In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
})

In [3]:
df1

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [4]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando", "California"],
    "humidity": [65,68,75, 56],
})

In [5]:
df2

         city  humidity
0     chicago        65
1    new york        68
2     orlando        75
3  California        56

In [19]:
df4 = pd.DataFrame({
    "city": ["chicago","new york","orlando", "California"],
    "humidity": [65,68,75, 56],
})
df4

         city  humidity
0     chicago        65
1    new york        68
2     orlando        75
3  California        56

In [20]:
df5 = pd.merge(df1, df2, df4, on="city")
df5

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [6]:
df3 = pd.merge(df1, df2, on="city")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [7]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35, 38],
})
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [8]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "humidity": [65,68,71],
})
df2

        city  humidity
0    chicago        65
1   new york        68
2  san diego        71

In [9]:
df3=pd.merge(df1,df2,on="city",how="inner")
df3

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [11]:
df3=pd.merge(df1,df2,on="city",how="outer")
df3

        city  temperature  humidity
0   new york         21.0      68.0
1    chicago         14.0      65.0
2    orlando         35.0       NaN
3  baltimore         38.0       NaN
4  san diego          NaN      71.0

In [13]:
df1

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           38

In [12]:
df3 = pd.merge(df1,df2,on="city",how="left")
df3

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           38       NaN

In [14]:
df3 = pd.merge(df1,df2,on="city",how="right")
df3

        city  temperature  humidity
0    chicago         14.0        65
1   new york         21.0        68
2  san diego          NaN        71

In [15]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
df1

        city  temperature  humidity
0   new york           21        65
1    chicago           14        68
2    orlando           35        71
3  baltimore           38        75

In [16]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
df2

        city  temperature  humidity
0    chicago           21        65
1   new york           14        68
2  san diego           35        71

In [17]:
df3= pd.merge(df1,df2,on="city",how="outer", suffixes=('_first','_second'))
df3

,city,temperature_first,humidity_first,temperature_second,humidity_second
0,new york,21.0,65.0,14.0,68.0
1,chicago,14.0,68.0,21.0,65.0
2,orlando,35.0,71.0,NaN,NaN
3,baltimore,38.0,75.0,NaN,NaN
4,san diego,NaN,NaN,35.0,71.0

In [27]:
morshift = pd.DataFrame({"day": [1,2,3] ,"Zaid Branch": [100, 200 , 300]})
nightshift = pd.DataFrame({"day": [1,2,3],"Zaid Branch": [150, 250 , 350]})

In [28]:
morshift

   day  Zaid Branch
0    1          100
1    2          200
2    3          300

In [29]:
nightshift

   day  Zaid Branch
0    1          150
1    2          250
2    3          350

In [30]:
df3= pd.merge(morshift,nightshift,on="day",how="outer", suffixes=('_mornining','_night'))
df3

   day  Zaid Branch_mornining  Zaid Branch_night
0    1                    100                150
1    2                    200                250
2    3                    300                350